// Дефолтне значення праметрів функції.
// Напиши функцію myFunc, яка при викликові буде отримувати ім'я, отримуємо імя через prompt.
// +Якщо імені в масиві немає, через alert виводимо повідомлення "Вітаємо, бажаєте стати нашим клієнтом?", 
// +Якщо користувач тисне "ок" додаємо отримане ім'я в масив, та виводимо в алерт повідомлення, "{ім'я}, ми раді, що ви з нами". 
// +Якщо користувач тисне "Скасувати", виводимо повідомлення, "Шкода, ми всеодно будемо чекати на тебе".
// +Якщо клієнт є в списку, виводимо повідомлення в alert '{імя}, ми раді що ви повернулись'

let clients = ["олег", "сергій", "олена", "марія", "ольга"]
let getName = prompt("Вкажіть ім'я")

function myFunc(getName){
    for(let client of clients){
        if(client === getName){
            return alert(`${getName}, ми раді що ви повернулись`)
        }
    }
    if(confirm("Вітаємо, бажаєте стати нашим клієнтом?")){
        clients.push(getName)
        return alert(`${getName}, ми раді, що ви з нами`) 
    }else{
        return alert(`Шкода, ми всеодно будемо чекати на тебе`)
    }
}

console.log(myFunc(getName))