// Ви програмуєте онлайн магазин і потрібно створити функцію, 
// яка приймає на вхід об'єкт з інформацією про товар, включаючи назву
// товару, його ціну та кількість на складі. Функція повинна 
// повертати рядок з описом товару та його ціни з подальшим 
// застосуванням знижки, якщо така є. Якщо товару немає на складі, 
// функція повинна повернути повідомлення про це.

const product1 = {
    name: 'Сорочка',
    price: 100,
    stock: 10,
    discount: 20,
};
  
const product2 = {
    name: 'Кроси',
    price: 500,
    stock: 80,
    discount: 10,
};

let products = {
    name: [],
    price: [],
    stock: [],
    discount: []
}

