
// Оператори порівняння
// Коли нам потрібно щось порівняти ми використовуємо оператори порівняння. 
// Суть в тому, що який би із них ми не використовували, ми в завжди в кінцевому результаті отримаємо бульове значення 
// true або false
// ==  !=  ===  !==  >  <  >=  <=

const a = 5
const b = "5"

console.log(typeof a)
console.log(typeof b)
console.log(a === b)  // Строга рівність перевіряє тип і значення
console.log(a !== b)  // Строга не рівність перевіряє тип і значення

// Зверніть увагу оператори порівняння завжди перетворюють свої операнди до числа.
console.log('10' > 5);
// Відбувається перетворення рядка в число.Це одно і теж саме, якби ми написали так
console.log(Number('10') > 5);
console.log(Number(true) > 5); // true - дає 1, тому 1<5
console.log(Number(false) > 5);// false - дає 0, тому також 0<5

// Оператори рівності (== , ===) і нерівності (!= , !==)
// ✅ «ЗАВЖДИ ВИКОРИСТОВУЄМО СТРОГУ РІВНІСТЬ (===) ТА НЕРІВНІСТЬ (!==)
// Чому? Тому, що такої необхідносі у вас швидше за все і не буду. 
// В будь-кому випадку коли ви может їх використовувати ви зможете використовувати і оператори строгої рівності.
// Використання строгої рівності гарантує більш вірне виконання коду

const isEqual = 1 === true;
const isEquals = 1 == true;
const isEquaes = 0 == true;

console.log(isEqual, isEquals, isEquaes);